; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	spectrograph0 - mode
	thermograph3 - mode
	spectrograph2 - mode
	thermograph1 - mode
	Star13 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation10 - direction
	GroundStation1 - direction
	Star7 - direction
	GroundStation4 - direction
	GroundStation11 - direction
	Star12 - direction
	Star8 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation9 - direction
	GroundStation14 - direction
	GroundStation3 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation11)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star7)
	(supports instrument3 thermograph3)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star12)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star13)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star13)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 GroundStation11)
	(calibration_target instrument6 Star7)
	(calibration_target instrument6 Star13)
	(calibration_target instrument6 Star6)
	(supports instrument7 thermograph1)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star13)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 GroundStation14)
	(calibration_target instrument7 Star6)
	(supports instrument8 spectrograph2)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation14)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation9)
	(calibration_target instrument9 GroundStation10)
	(calibration_target instrument9 GroundStation11)
	(calibration_target instrument9 Star12)
	(supports instrument10 thermograph1)
	(calibration_target instrument10 Star7)
	(calibration_target instrument10 GroundStation1)
	(calibration_target instrument10 GroundStation9)
	(supports instrument11 thermograph1)
	(supports instrument11 thermograph3)
	(calibration_target instrument11 Star8)
	(calibration_target instrument11 Star12)
	(calibration_target instrument11 GroundStation11)
	(calibration_target instrument11 GroundStation14)
	(calibration_target instrument11 GroundStation4)
	(supports instrument12 thermograph1)
	(supports instrument12 spectrograph2)
	(supports instrument12 thermograph3)
	(calibration_target instrument12 GroundStation3)
	(calibration_target instrument12 GroundStation14)
	(calibration_target instrument12 GroundStation9)
	(calibration_target instrument12 GroundStation2)
	(calibration_target instrument12 GroundStation5)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
)
(:goal (and
	(pointing satellite2 GroundStation2)
	(have_image Star15 spectrograph0)
	(have_image Star16 thermograph1)
	(have_image Star17 thermograph3)
	(have_image Star18 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation0 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 star16 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star16)
   goals met: 0 of 5
5. (take_image satellite0 star16 instrument1 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 1 of 5
6. (turn_to satellite0 star15 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star15)
   goals met: 1 of 5
7. (take_image satellite0 star15 instrument1 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 2 of 5
8. (turn_to satellite0 star17 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star17)
   goals met: 2 of 5
9. (take_image satellite0 star17 instrument1 thermograph3)
   added: (have_image star17 thermograph3)
   goals met: 3 of 5
10. (turn_to satellite0 star18 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star18)
   goals met: 3 of 5
11. (take_image satellite0 star18 instrument1 spectrograph0)
   added: (have_image star18 spectrograph0)
   goals met: 4 of 5
12. (turn_to satellite2 groundstation2 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 groundstation2)
   goals met: 5 of 5
